---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
UV Constructor
UV Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | UV()()()() | Creates a default UV with the values (0, 0). |
|  | UV(Double, Double) | Creates a UV with the supplied coordinates. |

# See Also

UV Class

UV Members

Autodesk.Revit.DB Namespace